[
  {
    "id": "1",
    "title": "Software Engineer",
    "companyName": "Hormuud",
    "description": "Hormuud is seeking a skilled Software Engineer to join our dynamic team. You will be responsible for designing, coding, testing, and debugging software applications. Collaborate with cross-functional teams to develop innovative solutions and ensure the scalability and reliability of our products.",
    "skills": "Java, Python, JavaScript, RESTful APIs, SQL",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "2",
    "title": "Frontend Developer",
    "companyName": "Somtel",
    "description": "Somtel is hiring a Frontend Developer to create responsive and visually appealing web interfaces. Implement designs provided by UI/UX designers and optimize application performance. Stay updated with the latest trends and technologies in web development and ensure a seamless user experience.",
    "skills": "HTML, CSS, JavaScript, React.js, Responsive Design",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "3",
    "title": "Backend Developer",
    "companyName": "Salam Bank",
    "description": "Join Salam Bank as a Backend Developer and take charge of developing and maintaining the server-side logic of our applications. Work closely with frontend developers to design APIs, manage data storage, and implement robust security measures. Troubleshoot and resolve technical issues to ensure smooth operations.",
    "skills": "Node.js, Express.js, MongoDB, RESTful APIs, Security",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "4",
    "title": "Mobile App Developer",
    "companyName": "Dahabshiil",
    "description": "Dahabshiil is looking for a talented Mobile App Developer to build and maintain high-quality mobile applications. Collaborate with the design team to deliver intuitive user interfaces and exceptional user experiences. Stay up-to-date with mobile trends and implement best practices to optimize performance.",
    "skills": "Flutter, Android Studio, iOS Development, UI/UX Design",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "5",
    "title": "Full Stack Developer",
    "companyName": "Premier Bank",
    "description": "Premier Bank is seeking a skilled Full Stack Developer to work on both frontend and backend development tasks. Design and implement user interactions on web pages, ensuring seamless integration between the client and server sides. Collaborate with cross-functional teams to deliver high-quality software products.",
    "skills": "JavaScript, React.js, Node.js, SQL, RESTful APIs",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "6",
    "title": "DevOps Engineer",
    "companyName": "IBS Bank",
    "description": "IBS Bank is looking for a DevOps Engineer to streamline our development and deployment processes. Automate the software delivery pipeline, monitor system performance, and ensure the scalability and reliability of our applications. Collaborate with development and operations teams to deliver cutting-edge solutions.",
    "skills": "Linux, Docker, Kubernetes, Jenkins, CI/CD",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "7",
    "title": "Data Scientist",
    "companyName": "Bixi",
    "description": "Bixi is seeking a talented Data Scientist to extract insights from vast data sets and drive data-driven decision making. Develop machine learning models, analyze data trends, and present findings to stakeholders. Collaborate with software engineers to integrate data-driven solutions into our applications.",
    "skills": "Python, Machine Learning, Data Analysis, SQL",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "8",
    "title": "Quality Assurance Engineer",
    "companyName": "eDir",
    "description": "Join eDir as a Quality Assurance Engineer to ensure the delivery of high-quality software products. Develop and execute test plans, identify and report bugs, and work closely with the development team to resolve issues. Conduct thorough testing to guarantee a seamless user experience.",
    "skills": "Manual Testing, Test Automation, Bug Tracking, Agile",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "9",
    "title": "UX/UI Designer",
    "companyName": "Hormuud",
    "description": "Hormuud is looking for a creative UX/UI Designer to create engaging and intuitive user interfaces for our software products. Collaborate with cross-functional teams to understand user requirements and translate them into visually appealing designs. Conduct user research and usability testing to enhance user experiences.",
    "skills": "Adobe XD, Sketch, User Research, Wireframing",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "10",
    "title": "Software Architect",
    "companyName": "Somtel",
    "description": "Join Somtel as a Software Architect and lead the design and development of scalable and maintainable software systems. Define architecture patterns, oversee code reviews, and ensure adherence to best practices. Work closely with development teams to provide technical guidance and resolve architectural challenges.",
    "skills": "Software Design Patterns, System Architecture, Code Review",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "11",
    "title": "iOS Developer",
    "companyName": "Salam Bank",
    "description": "Salam Bank is seeking a talented iOS Developer to create cutting-edge applications for Apple devices. Collaborate with cross-functional teams to design and implement new features, fix bugs, and optimize performance. Stay updated with the latest iOS trends and technologies to deliver seamless user experiences.",
    "skills": "Swift, Xcode, iOS App Development, CocoaTouch",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "12",
    "title": "Android Developer",
    "companyName": "Dahabshiil",
    "description": "Dahabshiil is looking for a skilled Android Developer to create innovative and user-friendly applications for Android devices. Collaborate with UI/UX designers to deliver visually appealing interfaces. Implement best practices for mobile app development and ensure compatibility across various Android devices.",
    "skills": "Java, Kotlin, Android Studio, Material Design",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "13",
    "title": "Cloud Solutions Architect",
    "companyName": "Premier Bank",
    "description": "Premier Bank is seeking a Cloud Solutions Architect to design and implement scalable and secure cloud-based solutions. Evaluate cloud technologies, develop migration strategies, and optimize cloud infrastructure for performance and cost-efficiency. Collaborate with development teams to deploy and manage cloud applications.",
    "skills": "AWS, Azure, Google Cloud, Cloud Security",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "14",
    "title": "Machine Learning Engineer",
    "companyName": "IBS Bank",
    "description": "IBS Bank is looking for a talented Machine Learning Engineer to develop and deploy machine learning models. Work on data preprocessing, feature engineering, and model training. Collaborate with data scientists and software engineers to integrate machine learning capabilities into our applications.",
    "skills": "Python, Machine Learning, TensorFlow, Data Preprocessing",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "15",
    "title": "Software Development Manager",
    "companyName": "Bixi",
    "description": "Bixi is seeking a Software Development Manager to lead and mentor our software engineering teams. Drive project planning, resource alcity, and ensure timely delivery of software projects. Collaborate with stakeholders to define project requirements and manage development processes.",
    "skills": "Software Project Management, Leadership, Agile Methodology",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "16",
    "title": "Database Administrator",
    "companyName": "eDir",
    "description": "Join eDir as a Database Administrator and manage our databases to ensure data security and integrity. Design and implement database structures, optimize query performance, and monitor database health. Collaborate with software engineers to integrate data solutions into our applications.",
    "skills": "SQL, Database Design, Performance Tuning, Data Security",
    "jobType": "Full-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },

  {
    "id": "17",
    "title": "Part-Time Web Developer",
    "companyName": "Hormuud",
    "description": "Hormuud is looking for a skilled Part-Time Web Developer to assist in building and maintaining web applications. Collaborate with the development team to implement new features, fix bugs, and optimize website performance. This position offers flexible hours to accommodate your schedule.",
    "skills": "HTML, CSS, JavaScript, Web Development",
    "jobType": "Part-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "18",
    "title": "Part-Time Mobile App Developer",
    "companyName": "Somtel",
    "description": "Join Somtel as a Part-Time Mobile App Developer to work on exciting mobile app projects. Develop and maintain mobile applications for Android and iOS platforms. This part-time role allows you to balance work and other commitments effectively.",
    "skills": "Flutter, React Native, Mobile App Development",
    "jobType": "Part-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "19",
    "title": "Part-Time Software Tester",
    "companyName": "Salam Bank",
    "description": "Salam Bank is seeking a Part-Time Software Tester to perform manual testing of software applications. Develop test cases, execute test plans, and report bugs to the development team. This flexible part-time position is ideal for those with a passion for quality assurance.",
    "skills": "Manual Testing, Bug Tracking, Software Quality Assurance",
    "jobType": "Part-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  },
  {
    "id": "20",
    "title": "Part-Time Technical Support Specialist",
    "companyName": "Dahabshiil",
    "description": "Dahabshiil is looking for a Part-Time Technical Support Specialist to provide assistance to software users. Respond to user inquiries, troubleshoot technical issues, and offer timely solutions. This part-time role allows you to contribute your expertise while accommodating your other commitments.",
    "skills": "Technical Support, Troubleshooting, Customer Service",
    "jobType": "Part-time",
    "budget": "Negotiable",
    "city": "Mogadishu",
    "createdAt": "2023-07-28"
  }
]
